<h1>DATA CLEANING</h1>

Data Cleaning refers to transformation of raw data to a useful structured form, which is used for further analysis.

The process includes various steps like dealing with missing values.

Pandas provide methods like drop_duplicates, isnull, etc to deal with missing data.

<h4>MISSING VALUES</h4>

1 - Standard Types : NA,NaN, ""   (pandas recognize automatically)
2 - Non Standard Types : n/a, na, "--" (pandas not recognize automatically)
3 - Unexpected Types : Joe, Mary, Bob, 12(?)

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('propert_data.csv')
df

   ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS
0   104.0      PUTNAM            Y            3
1   197.0   LEXINGTON            N            3
2     NaN   LEXINGTON            N          NaN
3   201.0    BERKELEY           12            1
4   203.0    BERKELEY            Y            3
5   207.0    BERKELEY            Y          NaN
6     NaN  WASHINGTON          NaN            2
7   213.0     TREMONT            Y           --
8   215.0     TREMONT            Y           na

In [4]:
print(df['ST_NUM'].isnull())

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [5]:
print(df['NUM_BEDROOMS'].isnull())

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
Name: NUM_BEDROOMS, dtype: bool

In [ ]:
# So in NUM_BEDROOM , pandas not recognize na and -- (as missing values)

In [6]:
# So first we need to create the list of non standard types
missing_values = ["n/a","na","--"]

In [10]:
df = pd.read_csv('propert_data.csv',na_values=missing_values)
df

   ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS
0   104.0      PUTNAM            Y           3.0
1   197.0   LEXINGTON            N           3.0
2     NaN   LEXINGTON            N           NaN
3   201.0    BERKELEY           12           1.0
4   203.0    BERKELEY            Y           3.0
5   207.0    BERKELEY            Y           NaN
6     NaN  WASHINGTON          NaN           2.0
7   213.0     TREMONT            Y           NaN
8   215.0     TREMONT            Y           NaN

In [11]:
df['NUM_BEDROOMS'].isnull()

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7     True
8     True
Name: NUM_BEDROOMS, dtype: bool

In [ ]:
# Now pandas recognize the non standard types of missing valuess

In [12]:
# Now we will look at Unexpected Types
# example in OWN_OCCUPIED - we have '12' which is incorrect type and one blank value

In [13]:
df ['OWN_OCCUPIED'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In [14]:
# It only recognize the blank as misisng value, but for 12 (it not recognize wrong value)

In [15]:
# There are number of ways to handle '12' we try to change every element to intger
# if it able to change then it's integer and we need to handle
# we will use error handling

In [16]:
cnt = 0
for row in df['OWN_OCCUPIED']:
    try:
        int(row)
        df.loc[cnt,'OWN_OCCUPIED']=np.nan
    except ValueError:
        pass
    cnt = cnt + 1

In [17]:
print(df['OWN_OCCUPIED'])

0      Y
1      N
2      N
3    NaN
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

In [18]:
df['OWN_OCCUPIED'].isnull()

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In [19]:
print(df.isnull().sum())

ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    4
dtype: int64

In [21]:
print(df.isnull().values.any())

True

In [22]:
print(df.isnull().sum().sum())

8

In [24]:
# we can fill missin value with any number
df['ST_NUM'].fillna(125,inplace=True)
print(df['ST_NUM'])

0    104.0
1    197.0
2    125.0
3    201.0
4    203.0
5    207.0
6    125.0
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [26]:
# we can also full usin .loc method
df.loc[2,'ST_NUM']=125
print(df['ST_NUM'])

0    104.0
1    197.0
2    125.0
3    201.0
4    203.0
5    207.0
6    125.0
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [27]:
# replace with median value
median = df['NUM_BEDROOMS'].median()
print(median)
df['NUM_BEDROOMS'].fillna(median,inplace=True)d

3.0